In [1]:
import numpy as np 
import pandas as pd

### Creating a Dataset

In [3]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}
df = pd.DataFrame(data)

In [5]:
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [8]:
data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]

df2 = pd.DataFrame(data_list)
col = ["Name","Age","City","Salary"]
df2 = pd.DataFrame(data_list,columns=col)
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

### Selection And Indexing of Columns

In [15]:
df2['Age']
df2[['Name','City']]

    Name      City
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

### Creating a new column

In [30]:
df2['Designation'] = ['Doctor','Engineer','Businessman','IT']
df2

    Name  Age      City  Salary  Designation
0   John   28  New York   65000       Doctor
1   Anna   34     Paris   70000     Engineer
2  Peter   29    Berlin   62000  Businessman
3  Linda   42    London   85000           IT

### Remove A Column

In [31]:
df2.drop('Designation',axis=1,inplace=True)

In [32]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

### Selecting Rows

- If we do `df2.loc[[0,2]]` then it will select 0th and 2nd row only..
- If we do `df2.iloc[0:3]` then it will select 0th to 2nd row.

In [37]:
df2.loc[[0,2]]
df2.iloc[0:3]

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000

### Selecting Subsets of Rows and Columns

In [41]:
# df2.loc[[0,1]][['City','Salary']]
df2
df2.loc[[2,3]][['Name','Age']]

    Name  Age
2  Peter   29
3  Linda   42

### Conditional Selection

In [44]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [60]:
df2[df2['Age'] > 30]

    Name  Age    City  Salary
1   Anna   34   Paris   70000
3  Linda   42  London   85000

In [62]:
df[(df2['Age'] > 30) & (df2['City'] == 'Paris')]

   Name  Age   City  Salary
1  Anna   34  Paris   70000